Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Streamline open source management upon two important foundational elements: a simple and clear compliance policy and a lightweight compliance process.
ja: 能率的なオープンソース管理は二つの基盤の上に成り立ちます：簡単で明確なコンプライアンスポリシーと、軽いコンプライアンスプロセスです。

source: Street Address
ja: 住所、郵便番号

source: Submit requests to use open source software: Engineering and product teams decide what external software to bring into the product baseline, including third-party and open source.
ja: オープンソース ソフトウェアについて要望を提出：エンジニアリングと製品のチームは製品の基盤として導入すべき外部のソフトウェアを決定します。これはサードパーティやオープンソースのソフトウェアを含みます。

source: Submitter Information
ja: 提出者情報

source: Submitter Information Company ID of employee submitting the form (facilitating retrieval of employee name, phone, email, manager, location, and team from a company directory)
ja: 提出者情報 フォームを提出する社員の社員ID（社員名、電話、Eメール、管理者、職務場所、チームなどを社員管理表から受け取ります）

source: Subsequently, the process begins with preparing source code for external distribution, following a pre- distribution checklist, ensuring source code package availability, and then completing the post- distribution checklist.
ja: プロセスは、外部へ頒布するソース コードの準備をもって始まり、頒布前チェックリストの確認、ソース コード パッケージの入手性の確認、そして、頒布後チェックリストの確認と続きます。

source: Subsequently, the process begins with preparing source code for external distribution, following a pre-distribution checklist, ensuring source code package availability, and then completing the post-distribution checklist.
ja: プロセスは、外部へ頒布するソース コードの準備をもって始まり、頒布前チェックリストの確認、ソース コード パッケージの入手性の確認、そして、頒布後チェックリストの確認と続きます。

source: Such a process would:
ja: そのようなプロセスは：

source: Such a tool enables efficient incremental compliance when facing newer versions of an existing base code (for instance, going from release 1.1 to 1.2).
ja: このようなツールは、（例えば、リリース1.1から1.2へ移行するなど）既存のベース コードの新しいバージョンを扱う時、インクリメンタル コンプライアンスを効率的に実施するのを可能にします。

source: Such actions have serious implication on compliance.
ja: これらの行動は、コンプライアンスに深く関わります。

source: Such admixtures may result in companies being forced to release proprietary source code under an open source license, thus losing control of their (presumably) high-value intellectual property and diminishing their capability to differentiate in the marketplace.
ja: そうして混ぜてしまうと企業はプロプラエタリなソースコードをオープンソース ライセンスで開示することを強制され、（おそらくは）高い価値を持つ知財の制御を失い、市場における差別化が弱くなってしまいます。

source: Such checklists minimize the probability of error and ensure that everyone involved in open source management is aware of what needs to be done before moving to the next step in the process.
ja: そのようなチェックリストは、誤る確率を最小化し、オープン ソース管理に携わる全ての人がプロセスの次の段階へ進む前に何をすべきかを気づくようにさせます。

source: Such documentation can prove very useful when attempting to determine on which basis approval was provided for a given component and how issues were resolved.
ja: そうした文書は、該当するコンポーネントに提示された承認の基礎が何であったのか、課題はどのように解決されたのか、を特定するときに非常に役に立ちます。

source: Such guidance can be provided via a License Compatibility Matrix that covers most popular licenses.
ja: そのようなガイドラインは、一般的なほとんどのライセンスをカバーするライセンス両立性マトリックスによって得られます。

source: Such practical advice will enable software developers to make day-to-day decisions related to open source licenses without having to go back to Legal Counsel for every single question.
ja: そういう実際的なアドバイスは、ソフトウェア開発者が、法務担当に頼らなくてもできる、細かな問題に対する毎日の判断を可能にします。

source: Such pre-approvals usually also require the developer to capture any notices and to make sure they are sent to the documentation team.
ja: そのような事前承認は、開発者に、全ての通知を抜き取って、文書チームへ送付するように要求します。

source: Such reviews are mandatory only when a given interaction may invoke license compliance obligations.
ja: これを強制するのは、そうした関係がライセンス上のコンプライアンスの義務に関わるときのみでよいです。

source: Such source code scans can be scheduled to run on a monthly basis, for instance.
ja: こうしたソースコードのスキャンはたとえば毎月行います。

source: Such tools include:
ja: こうしたツールには

source: Supply Chain
ja: サプライチェーン

source: Supply Chain Mandate third party software providers to disclose open source in licensed or purchased software components
ja: サプライチェーン サードパーティプロバイダからライセンスされた、または購入したソフトウェアコンポーネントに含まれるオープンソースの情報の開示をサードパーティプロバイダに指示

source: Supply Chain can support open source compliance activities by mandating that third-party software (and hardware) providers disclose any open source that is being delivered with their wares, and by assisting with licensing-in third-party software that is bundled with and/or integrates open source packages.
ja: サプライ チェーン部門 はオープンソースのコンプライアンス活動をサードパーティのソフトウェア（そしてハードウェア）のサプライヤに対し、供給した品に含まれる全オープンソースを開示するよう命令することで、またオープンソースのパッケージとバンドルされたり統合されたりしているサードパーティのソフトウェアのライセンスを助けます 。

source: Supply Chain personnel are usually involved in moving software from the suppliers to your company.
ja: 供給元から自社へのソフトウェアの移管には通常、サプライ チェーン関係者が関わります。

source: Supply chain (software procurement) procedures must be updated to address the acquisition and use of open source.
ja: サプライチェーン (ソフトウェアの調達) 部門 の手続きはオープンソースの取得や利用を書き下したものに更新しなければなりません。

source: Support or customer service headaches as a result of version mismatches (as a result of people calling or emailing the support hotline and inquiring about source code releases).
ja: バージョンのミスマッチによりサポートやカスタマー サービス上の問題となる（サポート ホットラインに電話やemailでソースコード開示について問い合わせがくる結果）

source: TOOLS AND AUTOMATION
ja: ツールと自動化

source: TOOLS AND AUTOMATION 116
ja: ツールと自動化 116

source: TRAINING
ja: トレーニング

source: TRAINING 127
ja: トレーニング 127

source: Table 1 (next page) provides examples of common accidental admixture of proprietary and open source IP that can arise during the software development process leading to license compliance issues.
ja: 表1 (次ページ) はソフトウェア開発の過程においてプロプラエタリな知財とオープンソースの知財を誤って混ぜてしまい、ライセンス コンプライアンス問題となるありがちな例を示したものです。

source: Table 1.
ja: 表１

source: Table 10.
ja: 表10

source: Table 2 provides examples of the most common license compliance problems that occur during the software development process, and offers tips on how to avoid them.
ja: 表２にソフトウェア開発プロセスでの最も一般的なライセンス コンプライアンス問題の例、および回避方法を示します。

source: Table 2.
ja: 表2

source: Table 3 (next page) lists the most common compliance process failures that occur during the stages of the software development process, and discusses how to avoid them.
ja: 表３にソフトウェア開発で起きる最も一般的なコンプライアンスプロセス上の失敗のリスト 、および回避方法を示します。

source: Table 3.
ja: 表3

source: Table 4 describes the roles and responsibilities of each participant in this core team.
ja: 表４に個々の参加者のコアチームにおける役割と責任を示します。

source: Table 4.
ja: 表4

source: Table 5.
ja: 表5

source: Table 6 (on page 97) provides details on the form.
ja: 表6 (98ページ)はフォームの詳細です。

source: Table 6 (page 97) highlights the information requested in an OSRB usage form.
ja: 図6（97ページ）は、OSRB利用フォームで要求されている情報を示しています。

source: Table 6.
ja: 表6

source: Table 7.
ja: 表7

source: Table 8 shows one easy way developers can remind themselves of the proper actions associated with various licenses.
ja: 表8は、開発者が様々なライセンスに関連した適切な行動を思い出すのに簡単な一つの方法です。

source: Table 8.
ja: 表8

source: Table 9.
ja: 表9

source: Tables 9 and 10 (next page) provide additional information that Legal Counsel can provide to software developers.
ja: 表9と10（次ページ）は、法務担当がソフトウェア開発者に提供できる追加情報を示します。

source: Take necessary action to become compliant.
ja: コンプライアンスを満たすよう必要なアクションを取る

source: Taking steps in this direction, combined with an open and honest relationship, is very valuable.
ja: その方向に動き、オープンかつ正直な関係を気づくことは大いに価値があります。

source: Technical knowledge related to the company’s products .
ja: 企業の製品についての技術的知識

source: Template for architectural diagram (applies to an embedded environment that relies on C or C++)
ja: （CやC++に依存するような組み込み環境へ適用する）アーキテクチャー図のテンプレート

source: The BOM diff tool takes two BOM files as input, each corresponding to a different product release, and computes the delta to produce a list of changes as previously discussed.
ja: BOM差分ツールは、異なる製品リリースに対応する2つのBOMファイルを入力として受け取り、前に議論したように、変更リストを生成します。

source: The BOM file for each product release is stored on the build server.
ja: それぞれの製品リリースに対するBOMファイルは、ビルド サーバーに保存されます。

source: The COPYING, README, or LICENSE files for open source components
ja: オープン ソース コンポーネントに対するCOPYING, README, LICENSE ファイル

source: The COPYING, README, or LICENSE files for open source components .
ja: オープン ソース コンポーネントに対するCOPYING, README, LICENSE ファイル

source: The Compliance Officer drives the design reviews and invites different engineering participants depending on the software component in question.
ja: コンプライアンス オフィサーは設計のレビューを主導し、対象となるソフトウェア コンポーネントに応じて異なる参加者をエンジニアリング チームから招きます。

source: The Compliance Officer will drive the effort to resolve these issues.
ja: コンプライアンス オフィサーは、これらの課題解決を推進します。

source: The Compliance Officer, also called OSRB Chair or Manager/Director of Open Source, chairs the OSRB and manages the compliance program.
ja: コンプライアンス オフィサーはOSRB議長やオープンソース部長/役員とも呼ばれます。OSRBの議長でありコンプライアンスプログラムを管理します。

source: The Dronecode ‘full-stack’ platform approach, combined with the hardware and software innovations of its members, will bring about a new generation of drones that are autonomous, aware of their environments, and continuously connected - an airborne Internet of Things.”
ja: Dronecodeの「フルスタック」プラットフォーム アプローチは、メンバーのハードウェアとソフトウェアのイノベーションを結合しており、自律的で、環境を認識し、継続的にネット接続されている新世代ドローンを作り出すことでしょう。それは、飛行するIoTです。」

source: The Dronecode ‘full-stack’ platform approach, combined with the hardware and software innovations of its members, will bring about a new generation of drones that are autonomous, aware of their environments, and continuously connected - an airborne Internet of Things.” Chris Anderson, CEO, 3DR (Former Editor in Chief of Wired magazine and author of “The Long Tail”)
ja: Dronecodeの「フルスタック」プラットフォーム アプローチは、メンバーのハードウェアとソフトウェアのイノベーションを結合しており、自律的で、環境を認識し、継続的にネット接続されている新世代ドローンを作り出すことでしょう。それは、飛行するIoTです。」 Chris Anderson, CEO, 3DR （ワイアード マガジン 前編集長、「ロング テール」著者）

source: The Dronecode ‘full-stack’ platform approach, combined with the hardware and software innovations of its members, will bring about a new generation of drones that are autonomous, aware of their environments, and continuously connected .
ja: Dronecodeの「フルスタック」プラットフォーム アプローチは、メンバーのハードウェアとソフトウェアのイノベーションを結合しており、自律的で、環境を認識し、継続的にネット接続されている新世代ドローンを作り出すことでしょう。

source: The GPL and LGPL are examples of licenses in this category.
ja: GPL と LGPL は、このカテゴリーのライセンスの例です。

source: The Legal Counsel focuses on four essential duties:
ja: 法律顧問は４つの必須の義務があります。

source: The Legal Counsel is a core member of the OSRB, the committee that ensures compliance with open source licenses.
ja: 法律顧問はオープンソースライセンスへのコンプライアンスを確かなものとする委員会 、OSDBのコアメンバーです。

source: The Linux Foundation promotes, protects and standardizes Linux by providing unified resources and services needed for open source to successfully compete with closed platforms.
ja: The Linux Foundation は、Linux の普及促進、保護、ならびに標準化に取り組み、Linux/OSS がクローズドなプラットフォームに対抗するのに必要とされる統合されたリソースとサービスを提供します。

source: The OSEC is responsible for setting open source strategy, reviewing and approving release of IP, and providing approvals to release previously proprietary source code under a specific open source license.
ja: OSECの責任はオープンソース戦略の設定、知財の評価と解放の承認、従来はプロプラエタリだったソースコードを特定のオープンソースライセンス下で発表することの承認です。

source: The OSEC must approve the usage of any open source package where licensing terms require granting a patent license or patent non-assertion.
ja: ライセンスが特許許諾条項や非係争条項を要求している時には、OSECがオープン ソース利用の承認をしなければなりません。

source: The OSRB Chair monitors closure of tickets assigned to engineers during the Audit step.
ja: OSRBチェアは、監査ステップで技術者に割り当てられたチケットのクローズを監視します。

source: The OSRB Chair performs this review using an automated tool.
ja: OSRB チェアは、自動ツールを使用してこの調査を行います。

source: The OSRB guidelines typically cover:
ja: OSRBのガイドラインは通常以下をカバーします。

source: The OSRB guidelines typically cover: .
ja: OSRBのガイドラインは通常以下をカバーします。

source: The OSRB has approved the component’s usage in the product.
ja: OSRBはコンポーネントの製品への利用を承認している。

source: The OSRB is responsible for:
ja: OSRBは下記に責任を持ちます。

source: The OSRB must approve the form before engineering integrates the open source into the product build.
ja: 技術担当がそのオープン ソースを製品ビルドに統合する前に、OSRBがフォームを承認しなければなりません。

source: The Open Source Executive Committee (OSEC) consists of engineering, legal, and product marketing executives in addition to the Compliance Officer.
ja: オープンソース幹部会議 (OSEC) はエンジニアリング、法務、マーケティングの幹部に加えコンプライアンスオフィサーから構成されます。

source: The above license categories are a way to classify licenses to make it easier for developers to know the proper course of action when integrating code under these licenses.
ja: 上記のライセンス カテゴリは、これらのライセンスで許諾されたコードを統合する際に、開発者が適切な一連の行動を簡単に知ることができるように分類する一つの方法です。

source: The answer is simple: a bill of material difference tool (BOM diff tool), as discussed in Chapter 7.
ja: 答えは単純です。：第7章で議論しますが、BoM比較ツールです。

source: The approval comes from the OSRB (which includes, as described in an earlier chapter, Legal Counsel, an Engineering representative, and an open source expert).
ja: 承認はOSRBが行います。（前の章で説明したように、法務担当、技術代表、オープン ソース エキスパートが含まれます）

source: The approval of the Legal Counsel is required when using open source in a commercial product.
ja: オープンソースを商用製品に用いる時には法律顧問の承認が必要です。

source: The architectural diagram illustrates the interactions between the various software components in an example platform.
ja: アーキテクチャー図は、あるプラットフォーム上での様々なソフトウェア コンポーネント間の相互作用を示します。

source: The architecture review is an analysis of the interaction among open source, proprietary, and third-party software components.
ja: アーキテクチャー レビューは、オープン ソースとプロプライエタリやサード パーティ ソフトウェア コンポーネントとの相互作用に関する解析です。

source: The audit process consists of the following phases (Figure 22):
ja: 監査プロセスは、次のフェーズで構成されます。（図22）

source: The audit process consists of the workflow that requests follow after engineering has submitted an OSRB usage form for a specific software component.
ja: 監査プロセスは、技術担当が特定のソフトウェア コンポーネントに対するOSRB利用フォームを提出した後に、続いて実行されるワークフローから構成されます。

source: The auditing personnel perform a source code scan iteratively from one release to another, to build a chain of evidence that proves what is included in the release is compliant with the various applicable open source licenses.
ja: 監査担当者は、リリースに含まれているものは様々な適用可能なオープン ソース ライセンスに適合している証拠を、リリースごとに反復して、ソースコードスキャンを実施します。

source: The auditing policy is usually simple and straightforward: All source code included in the portfolio/stack must be audited and have an audit report attached to its compliance ticket.
ja: 監査ポリシーは、単純でわかりやすいものです：ポートフォリオ／スタックに含まれる全てのソース コードは、監査され、コンプライアンス チケットに監査報告がつけられなければなりません。

source: The business environment was predictable and companies mitigated potential risks through license and contract negotiations with the software vendors.
ja: ビジネス環境は予測可能で、企業は潜在的なリスクをソフトウェア ベンダーとのライセンス交渉や契約交渉を通じて軽減していました。

source: The communities of open source projects expect companies to honor the licenses of the open source software they include in their products.
ja: オープンソース プロジェクトのコミュニティは企業が自社製品に含まれるオープンソース ソフトウェアのライセンスを尊重すると期待しています。

source: The compliance officer discovers a linkages issue.
ja: コンプライアンス オフィサーは、リンクに関する課題を見つけます。

source: The compliance officer may order a re-scan of the source code and generate a new scan report confirming that earlier issues have now been resolved.
ja: コンプライアンス オフィサーは、ソース コードの再スキャンを依頼してスキャン報告書を作成し、前に上がった課題が解決済みになっていることを確認するかもしれません。

source: The compliance usage process includes scanning the source code of the software package in question, identifying and resolving any discovered issues, performing legal and architectural reviews, and making a decision regarding the usage approval for a given software package.
ja: コンプライアンス利用プロセスは、問題となるソフトウェア パッケージのソースコードのスキャン、発見された課題の特定と解決、法務レビューおよびアーキテクチャー レビューの実施、そのソフトウェア パッケージに対する利用許可に関する判断を含みます。

source: The component is registered in the software inventory, with the component name, version, internal owner, and the details of where the component is being used, such as product name, version, release number, etc.
ja: コンポーネントは、コンポーネント名、バージョン、内部所有者、および製品名、バージョン、リリース番号等のコンポーネントが利用される場所の詳細などと共に、ソフトウェア一覧表に登録されます。

source: The core team, often called the Open Source Review Board (OSRB), consists of representatives from engineering and product teams, one or more legal counsel, and the Compliance Officer.
ja: コアとなるのはオープンソース評価委員会 (Open Source Review Board, OSRB) と呼ばれることが多い委員会で、エンジニアリング、製品のチームの代表者たち、一人以上の法務顧問、そしてコンプライアンス オフィサーから構成されます。

source: The core team, often called the Open Source Review Board (OSRB), consists of representatives from engineering and product teams, one or more legal counsels, and the Compliance Officer.
ja: コアチームはオープンソース評価委員会 (Open Source Review Board, OSRB) と呼ばれることも多いです。エンジニアリングと製品のチームの代表者たち、一人以上の法務顧問、そしてコンプライアンス オフィサーから構成されます。

source: The decision is stop development and design a better solution.
ja: このケースの結論は、開発を中止し、より良いソリューションを設計し直すというものです。

source: The decision is to stop development and design a better solution.
ja: このケースの結論は、開発を中止し、より良いソリューションを設計しなおすというものです。

source: The discussions exclude policies and processes for using open source solely inside your organization for testing and evaluation purposes.
ja: ここでの議論では、テストや評価目的など組織内だけで利用されるオープン ソースのためのポリシーやプロセスは除外されます

source: The distribution policy applies to any software package where the license requires redistributing source code, and it covers the publication process, publication methods, modes, and checklists.
ja: この頒布ポリシーは、ライセンスがソース コードの再頒布を要求するようなソフトウェア パッケージに適用されます。公開プロセス、公開方法、モード、チェックリストなどをカバーします。

source: The documentation team is responsible for including written offers and any appropriate open source notices in the product documentation.
ja: 文書化チームは、ソースコードを得る方法についての 書面での告知や、製品に添付するオープンソースの通告すべてについて責任を持ちます。

source: The extended team consists of various individuals across multiple departments that contribute on an ongoing basis to the compliance efforts: Documentation, Supply Chain, Corporate Development, IT, Localization and the Open Source Executive Committee (OSEC).
ja: 拡大チームは様々な部門からコンプライアンス活動のため随時加わる人々で、文書作成、サプライチェーン、全社開発、IT、ローカル化、オープンソース幹部会議 (Open Source Executive Committee, OSEC)らが含まれます。

source: The extended team, described in Table 5 (page 49), consists of various individuals across multiple departments that contribute on an on-going basis to the compliance efforts: Documentation, Supply Chain, Corporate Development, IT, Localization, and the Open Source Executive Committee (OSEC).
ja: 拡大チームは表5 (49ページ) に示す通り、様々な部門からコンプライアンス活動のため随時加わる人々で、文書作成、サプライチェーン、全社開発 、IT、ローカル化、オープンソース幹部会議 (Open Source Executive Committee, OSEC)らが含まれます。

source: The external portal offers a consistent means of posting source code of open source packages they use, in fulfillment of license obligations.
ja: 社外向けポータルは、ライセンス義務を履行する形で、利用しているオープン ソース パッケージのソース コードを一貫した方法で提供します。

source: The external portal offers a public platform for the world and the open source community, as well as a venue to post source code of open source packages, acknowledgements, and other disclosures, in fulfillment of license obligations.
ja: 外部向けのポータルは社会とオープンソースコミュニティに向けて公開のプラットフォームとなり、またオープンソースのパッケージのソースコードや受領通知ほかの情報開示を投稿する場としてライセンス上の義務を履行します。

source: The external website usually exists for the primary reason of making available source code packages in fulfillment of certain compliance obligations.
ja: 外部向けのサイトは通常、ソースコードのパッケージを利用可能とし、特定のコンプライアンス上の義務を満たすことが第一の目的となります。

source: The final review is usually an OSRB face-to-face meeting during which the OSRB approves or denies usage.
ja: 最終レビューは、通常はOSRBメンバが対面する会議で行い、OSRBは利用の許可または却下を決めます。

source: The first challenge is to balance the compliance program and its supporting infrastructure with (existing) internal processes while meeting deadlines to ship products and launch services.
ja: 最初の難しさは、コンプライアンス プログラムやそれを支える（既存の）内部手続きのためのインフラと、製品出荷やサービス開始の〆切とのバランスを取ることです。

source: The following is a list of conditions that should be met before source code packages are ready for distribution (aka distribution hygiene):
ja: 以下は、ソース コード パッケージが頒布可能になる前に、適合しておくべき条件リストです。（頒布の衛生とも呼ばれます）

source: The following is a sample checklist to follow before publishing or distributing source code:
ja: 以下は、ソース コードの一般公開や頒布の前に行うチェックリスト例です。

source: The following is a sample checklist to go through after publishing source code, to validate the source code packages being made available:
ja: 以下は、ソース コードを一般公開した後に、ソース コード パッケージが入手可能になっているかを検証するチェックリストの例です。

source: The following sections address considerations and caveats for using open source in a fully compliant manner.
ja: 以下の節では、完全にコンプライアンスに適合したオープン ソース利用についての、考察と警告を示します。

source: The following sections expand on these general guidelines in more detail.
ja: 以下の節では、これらのガイドラインの細かな議論を発展させます。

source: The following sections provide recommended practices for processing compliance requests.
ja: 以下の節では、コンプライアンス要求を処理するための推奨プラクティスを示します。

source: The form applies only to the usage of open source in a specific product and in a specific context.
ja: フォームは、特定の利用状況における、特定の製品でのオープン ソースの利用に対して適用します。

source: The form comprises several questions that will provide necessary information for the OSRB, allowing it to approve or disapprove the usage of the proposed open source component.
ja: そのフォームは、提案されているオープン ソース コンポーネントの利用をOSRBが承認または却下することを決めるのに必要な情報を与えるような、いくつかの質問から構成されています。

source: The form describes the intended use of the open source in question and helps construct and maintain a good record of software origin and provenance.
ja: この書類には問題となるオープンソースの利用方法を記述します。これはソフトウェアの起源と由来について良好な記録を構築し維持する助けとなります。

source: The form is the basis of audit activity and provides information the OSRB needs to verify if the implementation is consistent with the usage plan expressed in the form, and with the audit and architectural review results.
ja: フォームは、監査活動の基礎となり、OSRBが、フォームで表現された利用計画と、監査やアーキテクチャー レビューの結果とに矛盾が無いかを確認するための情報を提供します。

source: The form must be updated and resubmitted whenever the usage plans for that specific open source component changes.
ja: フォームは、該当するオープン ソース コンポーネントの利用計画が変更になった場合には、更新して再提出されなければなりません。

source: The goal is to determine if any open source obligations extend to proprietary or third party software components.
ja: この目標は、プロプラエタリやサードパーティのソフトウェア コンポーネントにオープンソース上の義務が何ら及んでいないことの確定です。

source: The goal is to make quality assurance activities a regular part of the development process.
ja: その目的は、品質保証活動が開発プロセスの定常的な一部となることです。

source: The goal of a Software BOM difference tool is to compute the difference between two BOMs and produce a list of changes.
ja: ソフトウェアBOM差分ツールの目的は、二つのBOMの差分を計算し、変更リストを生成することです。

source: The goal of a distribution policy is to govern the process of supplying source project code and to provide guidelines on the various logistical aspects of meeting open source license obligations regarding the availability of open source code.
ja: 頒布ポリシーの目的は、ソース プロジェクト コード（＊＊＊）の供給プロセスに強い影響を与え、オープン ソース コードの入手性に関するオープン ソース ラインセンス義務の遵守するために、様々な流通[ロジスティックス]に対するガイドラインを提供することです。

source: The goal of a linkage analysis review is to find potentially problematic code combinations at the static and dynamic link level, such as linking a GPL or more commonly an LGPL-licensed library to a proprietary source code component.
ja: リンク解析の目的は、動的および静的リンク レベルで、GPL ライブラリをプロプライエタリ ソース コード コンポーネントにリンクしているなど、問題発生の可能性のあるコードの組み合わせ を検出することです。

source: The goal of open source and compliance training is to raise awareness of open source policies and strategies and to build a common understanding of the issues and facts of open source licensing.
ja: オープン ソースとコンプライアンスに関するトレーニングの目標は、オープン ソース ポリシーと戦略についての意識を高め、オープン ソース ライセンスの課題と事実について共通理解を形成することです。

source: The goal of providing open source and compliance training .
ja: オープンソースとコンプライアンスの教育の目標は、

source: The goal of the architecture review is to analyze any interactions between the open source, third-party, and proprietary code.
ja: アーキテクチャー レビューの目的は、オープン ソース、サード パーティ、プロプライエタリ コード間の相互作用を解析することです。

source: The goal of the architecture review is to analyze the interactions between the open source code and third-party and proprietary code.
ja: アーキテクチャー レビューの目的は、オープン ソース コードとサード パーティ、プロプライエタリ コードの間の相互作用を解析することです。
